# CannotDrawInCurrentView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..CannotDrawInCurrentView Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawInCurrentView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawInCurrentView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawInCurrentView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace